public class Main {

    public static void main(String[] args) {
        int amount = 20_000;
        int cost = 20;

        int bonus = amount / cost;
        // System.out.println("Стоимость билета - "+ amount + " рублей ");
        System.out.println("Бонусные мили - " + bonus + " мили ");

        // Объявляете переменные для входных данных и
        // параметров программы: одну для хранения
        // стоимости билета, другую для хранения количества
        // рублей для одной бонусной милли

        // Рассчитываете количество бонусных милль, используя
        // значения заведённых переменных. Ответ сохраняете в
        // новую переменную и выводите на экран
    }
}